# Taps
tap 'homebrew/cask'
tap 'homebrew/services'
tap 'homebrew/cask-fonts'

tap 'borgbackup/tap'
tap 'buo/cask-upgrade'
tap 'martido/homebrew-graph'
tap 'moncho/dry'
tap 'rdp/homebrew-openssh-gssapi'
tap 'romkatv/gitstatus'
tap 'romkatv/powerlevel10k'
tap 'scullionw/tap'

# GNU alternatives to BSD utils
brew 'coreutils'
brew 'findutils'
brew 'ed'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'grep'

# Other useful GNU utils
brew 'automake'
brew 'binutils'
brew 'diffutils'
brew 'gawk'
brew 'gnutls'
brew 'gpatch'
brew 'gzip'
brew 'make'
brew 'nano'
brew 'screen'
brew 'stow'
brew 'wdiff'
brew 'wget'

# Bash
brew 'bash'
brew 'bash-completion@2'

# ZSH
brew 'romkatv/powerlevel10k/powerlevel10k'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'zsh'

# Archive utilities
brew 'lzip'
brew 'plzip'

brew 'bzip2'
brew 'lbzip2'
brew 'pbzip2'

brew 'p7zip'
brew 'pigz'
brew 'unar'
brew 'xz'
brew 'zopfli'

# OpenSSH with GSSAPI support
brew 'rdp/homebrew-openssh-gssapi/openssh-patched', args: ['with-gssapi-support']

# Other binaries
brew 'ack'
brew 'bat'
brew 'boost'
brew 'borgbackup/tap/borgbackup-fuse'
brew 'borgmatic'
brew 'broot'
brew 'btop'
brew 'catch2'
brew 'cheat'
brew 'cmake'
brew 'ctop'
brew 'diff-so-fancy'
brew 'diskus'
# brew 'dockutil'
brew 'duc'
brew 'duf'
brew 'duti'
brew 'fasd'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gdu'
brew 'gh'
brew 'ghostscript'
brew 'git'
brew 'git-delta'
brew 'graphviz'
brew 'highlight'
brew 'htop'
brew 'hyperfine'
brew 'imagemagick'
brew 'lazydocker'
brew 'mackup'
brew 'mas'
brew 'moncho/dry/dry'
brew 'moreutils'
brew 'neofetch'
brew 'neovim'
brew 'pandoc'
brew 'pygments'
brew 'ripgrep'
brew 'romkatv/gitstatus/gitstatus'
brew 'root'
brew 'rsync'
brew 'scullionw/tap/dirstat-rs'
brew 'shpotify'
brew 'svn'
brew 'tealdeer'
brew 'terminal-notifier'
brew 'thefuck'
brew 'tmux'
brew 'tokei'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'xplr'
brew 'zoxide'

# Cask apps
cask '1password'
cask 'adguard'
cask 'aerial'
cask 'alfred'
cask 'alt-tab'
cask 'bartender'
cask 'bettertouchtool'
cask 'boop'
cask 'cleanshot'
cask 'cron'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'hammerspoon'
cask 'hook'
cask 'iterm2'
cask 'karabiner-elements'
cask 'launchbar'
cask 'logseq'
cask 'little-snitch'
cask 'macfuse'
cask 'mactex-no-gui'
cask 'macupdater'
cask 'mimestream'
cask 'miniforge'
cask 'movist-pro'
cask 'numi'
cask 'obsidian'
cask 'raycast'
cask 'sip'
cask 'skim'
cask 'skype'
cask 'soundsource'
cask 'spotify'
cask 'stats'
cask 'sublime-merge'
cask 'sublime-text'
cask 'suspicious-package'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vorta'
cask 'xquartz'
cask 'zoom'

# Quicklook plugins
cask 'syntax-highlight'
cask 'qlmarkdown'

# Fonts
cask 'font-anonymous-pro'
cask 'font-fira-code-nerd-font'
cask 'font-fira-code'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-inconsolata'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask "font-hasklig"
cask "font-space-mono"
