tap 'rdp/homebrew-openssh-gssapi'
tap 'homebrew/services'
tap 'romkatv/gitstatus'

# Install GNU alternatives to BSD utils
brew 'coreutils'
brew 'findutils'
brew 'ed'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'grep'

# Install other useful GNU utils
brew 'binutils'
brew 'diffutils'
brew 'gawk'
brew 'gnutls'
brew 'gpatch'
brew 'gzip'
brew 'make'
brew 'nano'
brew 'screen'
brew 'stow'
brew 'wdiff'
brew 'wget'

# Install Bash
brew 'bash'
brew 'bash-completion@2'

# Install binaries
brew 'ack'
brew 'bat'
brew 'broot'
brew 'btop'
brew 'cmake'
brew 'dockutil'
brew 'duf'
brew 'duti'
brew 'fasd'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gdu'
brew 'gh'
brew 'ghostscript'
brew 'git'
brew 'gitstatus'
brew 'highlight'
brew 'imagemagick'
brew 'lazygit'
brew 'lbzip2'
brew 'lzip'
brew 'mackup'
brew 'mas'
brew 'neofetch'
brew 'neovim'
brew 'pandoc'
brew 'pigz'
brew 'pbzip2'
brew 'pygments'
brew 'ripgrep'
brew 'root'
brew 'rsync'
brew 'shpotify'
brew 'ssh-copy-id'
brew 'svn'
brew 'thefuck'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'unar'
brew 'vim'
brew 'watch'
brew 'xz'
brew 'zopfli'
brew 'zoxide'

# Install OpenSSH with GSSAPI support
brew 'rdp/homebrew-openssh-gssapi/openssh-patched', args: ['with-gssapi-support']







